amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/getBucketVersioning.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.getbucketversioning">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:accessKeyId>AKIAJ5H4DUFA3O2VJMLA</urn:accessKeyId>
      <urn:secretAccessKey>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</urn:secretAccessKey>
      <urn:methodType>GET</urn:methodType>
      <urn:contentLength>3</urn:contentLength>
      <urn:contentType>application/xml</urn:contentType>
      <urn:contentMD5/>
      <urn:expect>100-continue</urn:expect>
      <urn:host>s3.amazonaws.com</urn:host>
      <urn:xAmzDate>true</urn:xAmzDate>
      <urn:xAmzSecurityToken/>
      <urn:bucketName>fancyBucket</urn:bucketName>
      <urn:uriRemainder>/?versioning</urn:uriRemainder>
      <urn:bucketUrl>http://s3.amazonaws.com/fancyBucket</urn:bucketUrl>
   </soapenv:Body>
</soapenv:Envelope>